Repository: EgoChronos/Nusuk-for-Eman-App
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Nusuk for Eman
ar: نُسك لإيمان

# homeTitle
source: Home
ar: الرئيسية

# quranTitle
source: Qur'an
ar: القرآن الكريم

# audioTitle
source: Listen to Qur'an
ar: استمع للقرآن

# dhikrTitle
source: Dhikr
ar: الأذكار

# hadithTitle
source: Hadith
ar: أحاديث نبوية

# duaaTitle
source: Duaa
ar: دعاء

# settingsTitle
source: Settings
ar: الإعدادات

source: Continue Reading
ar: متابعة القراءة

source: Listen Full Qur'an
ar: استمع للقرآن كاملاً

source: Today's Dhikr
ar: أذكار اليوم

source: Make Duaa
ar: ادعُ لها

# giftedToSoul
source: This deed is gifted to Eman Mohammed Tayee
ar: هذا العمل هدية لروح إيمان محمد طايع

source: Privacy Policy
ar: سياسة الخصوصية

source: About App
ar: عن التطبيق

source: Enable Notifications
ar: تفعيل الإشعارات

# enableNotificationsDesc
source: Turn on/off all notifications
ar: تشغيل/إيقاف جميع التنبيهات

# remindersSection
source: Reminders
ar: تذكيرات

source: Morning Adhkar
ar: أذكار الصباح

source: Evening Adhkar
ar: أذكار المساء

source: Sleep Adhkar
ar: أذكار النوم

# surahKahf
source: Surah Al-Kahf
ar: سورة الكهف

# inspirationsSection
source: Inspirations
ar: إلهامات

source: Floating Content
ar: نفحات إيمانية

# floatingContentDesc
source: Random Verses, Hadiths, and Duaas throughout the day
ar: آيات، أحاديث، وأدعية عشوائية خلال اليوم

source: Frequency
ar: التكرار

# freqLow
source: Low
ar: قليل

# freqMedium
source: Medium
ar: متوسط

# freqHigh
source: High
ar: كثير

source: Reset Progress
ar: إعادة تعيين التقدم

# resetProgressDesc
source: Clear all counters and bookmarks
ar: مسح جميع العدادات والإشارات المرجعية

# resetConfirmTitle
source: Reset Progress?
ar: هل أنت متأكد؟

# resetConfirmContent
source: This will clear all reading progress, bookmarks, and counters. This cannot be undone.
ar: سيتم مسح جميع بيانات القراءة والعدادات. لا يمكن التراجع عن هذا الإجراء.

source: Cancel
ar: إلغاء

source: Reset
ar: مسح

# themeTitle
source: Appearance
ar: المظهر

source: Dark Mode
ar: الوضع الداكن

# darkModeDesc
source: Use dark theme
ar: تفعيل الوضع الليلي

# languageTitle
source: Language
ar: اللغة

# fontSizeTitle
source: Font Size
ar: حجم الخط

source: Manage Notifications
ar: إدارة التنبيهات

# manageNotificationsDesc
source: Configure reminders & content
ar: ضبط أوقات التذكير والمحتوى

# myStats
source: My Lifetime Stats
ar: إحصائياتي

source: Ayahs Read
ar: آية مقروءة

source: Dhikr & Tasbeeh
ar: ذكر وتسبيح

source: Duaas Made
ar: دعاء

source: Listening Time
ar: وقت الاستماع

source: Privacy
ar: الخصوصية

# surahsTab
source: Surahs
ar: السور

# bookmarksTab
source: Bookmarks
ar: العلامات المرجعية

# ayahCountLabel
source: {count} ayahs read
ar: {count} آية مقروءة

source: Khatma progress
ar: تقدم الختمة

source: New Khatma
ar: ختمة جديدة

# khatmaResetNote
source: Reading progress resets at the start of each Hijri month
ar: يُحفظ تقدم القراءة تلقائيًا ويمكنك البدء بختمة جديدة يدويًا

# searchQuranHint
source: Search for Surah or Ayah...
ar: ابحث عن سورة أو آية...

source: No bookmarks yet
ar: لا توجد علامات مرجعية بعد

# markSurahRead
source: Mark entire surah as read
ar: تحديد السورة كمقروءة

source: Already fully read
ar: مقروءة بالكامل

source: Loved by Eman
ar: كانت تحبها إيمان

# continueFromLeftOff
source: Continue from where you left off
ar: تابع من حيث توقفت

# tasbeehToday
source: {count} tasbeeh today
ar: {count} تسبيحة اليوم

source: Global Impact
ar: أثر جماعي

# liveUpdatesDesc
source: Live updates from all users around the world
ar: إحصائيات مباشرة من جميع المستخدمين

source: Last saved update
ar: آخر تحديث محفوظ

# statQuran
source: Qur'an
ar: القرآن الكريم

# ayahNumberHeader
source: Ayah {count}
ar: آية {count}

source: Mark as Read
ar: تحديد كمقروء

source: Already Read
ar: مقروءة بالفعل

source: Bookmark Ayah
ar: حفظ الآية

source: Remove Bookmark
ar: إزالة الحفظ

source: Read until here
ar: قرأت حتى هنا

# markPreviousAsRead
source: Mark all previous ayahs as read
ar: تحديد كل الآيات السابقة كمقروءة

# surahMarkedRead
source: Surah marked as fully read
ar: تم تحديد السورة كمقروءة بالكامل

# permissionSetupTitle
source: Run Settings
ar: إعدادات التشغيل

# permissionSetupDesc
source: To ensure reminders and content arrive on time, please enable the following permissions:
ar: لضمان وصول الأذكار والمحتوى الإيماني في وقتها، يرجى تفعيل الصلاحيات التالية:

# overlayPermissionTitle
source: Display over other apps
ar: الظهور فوق التطبيقات

# overlayPermissionDesc
source: Allows the floating window to appear on screen.
ar: يسمح بظهور النافذة العائمة للأذكار على الشاشة.

# batteryPermissionTitle
source: Ignore battery restrictions
ar: تجاهل قيود البطارية

# batteryPermissionDesc
source: To allow the app to run in the background for reliable notifications
ar: للسماح بتشغيل التطبيق في الخلفية لضمان الإشعارات

# appearancePermissionTitle
source: Notification appearance
ar: صلاحيات ظهور التنبيهات

# appearancePermissionDesc
source: Enable "Background pop-ups" and "Show on lock screen" for best performance.
ar: تفعيل "عرض النوافذ المنبثقة" و"العرض على قفل الشاشة" لضمان عمل التطبيق بكفاءة.

# allPermissionsGranted
source: Great! All permissions are now granted
ar: رائع! جميع الصلاحيات مفعلة الآن

# permissionBannerAlert
source: Alert: Setup incomplete ({count}/3) ‚Üê
ar: تنبيه: الإعداد غير مكتمل ({count}/3) ←

source: Run Settings
ar: إعدادات التشغيل

# runSettingsDesc
source: To ensure notifications arrive on time
ar: لضمان وصول الإشعارات في الموعد المحدد
